INSERT INTO authors (author_id, author_first_name, author_last_name)
VALUES (1, 'Джордж', 'Оруэлл'),
       (2, 'Джоан', 'Роулинг'),
       (3, 'Федор', 'Достоевский'),
       (4, 'Агата', 'Кристи'),
       (5, 'Эрнест', 'Хемингуэй');

INSERT INTO books (book_id, book_name, book_count, price, author_id)
VALUES (1, '1984', 15, 450.00, 1),
       (2, 'Гарри Поттер и философский камень', 20, 600.00, 2),
       (3, 'Преступление и наказание', 10, 500.00, 3),
       (4, 'Убийство в "Восточном экспрессе"', 12, 400.00, 4),
       (5, 'Старик и море', 8, 350.00, 5),
       (6, 'Гарри Поттер и Тайная комната', 18, 620.00, 2),
       (7, 'По ком звонит колокол', 5, 470.00, 5);

INSERT INTO clients (client_id, client_name)
VALUES (1, 'Анна Петровна'),
       (2, 'Иван Иванов'),
       (3, 'Олег Смирнов'),
       (4, 'Мария Куприянова'),
       (5, 'Александр Сидоров');

INSERT INTO orders (order_id, client_id, order_date)
VALUES (1, 1, '2025-09-12'),
       (2, 2, '2025-09-14'),
       (3, 3, '2025-09-15'),
       (4, 1, '2025-10-02'),
       (5, 5, '2025-10-04'),
       (6, 4, '2025-10-11');

INSERT INTO order_items (order_id, book_id, quantity)
VALUES (1, 1, 1),
       (1, 2, 2),
       (2, 3, 1),
       (2, 4, 1),
       (3, 5, 1),
       (3, 2, 1),
       (4, 6, 2),
       (4, 1, 1),
       (5, 7, 1),
       (5, 3, 1),
       (6, 4, 2);